In [1]:
import pandas as pd

In [2]:
obj=pd.Series([4,5,6,7])

In [3]:
obj

0    4
1    5
2    6
3    7
dtype: int64

In [4]:
obj.values

array([4, 5, 6, 7], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj=pd.Series([2,3,5,6],index=['a','b','f','d'])

In [8]:
obj

a    2
b    3
f    5
d    6
dtype: int64

In [9]:
obj.index

Index(['a', 'b', 'f', 'd'], dtype='object')

In [10]:
obj["a"]

2

In [11]:
obj[["a","d"]]

a    2
d    6
dtype: int64

In [12]:
obj*2

a     4
b     6
f    10
d    12
dtype: int64

In [13]:
obj+2

a    4
b    5
f    7
d    8
dtype: int64

In [14]:
"b" in obj

True

In [15]:
sdata={"ohio":2500,"term":3400,"hong":4500}

In [16]:
obj3=pd.Series(sdata)

In [17]:
obj3

ohio    2500
term    3400
hong    4500
dtype: int64

In [18]:
states=["california","term","ohio","hong"]

In [20]:
obj4=pd.Series(sdata,index=states)

In [21]:

obj4

california       NaN
term          3400.0
ohio          2500.0
hong          4500.0
dtype: float64

In [33]:
pd.isnull(obj4)

california     True
term          False
ohio          False
hong          False
dtype: bool

In [36]:
obj4.name="population"
obj4.index.name="state"

In [37]:
obj4

state
california       NaN
term          3400.0
ohio          2500.0
hong          4500.0
Name: population, dtype: float64

In [38]:
obj

a    2
b    3
f    5
d    6
dtype: int64

In [40]:
obj.index=["ter","bedk0","ldlj","jdnfn"]

In [41]:
obj

ter      2
bedk0    3
ldlj     5
jdnfn    6
dtype: int64

In [42]:
data={"state":["ohio","ohio","ohio","neva","neva","neva"],"year":[2000,2001,2002,2001,2002,2003],"pop":[1.5,1.7,3.6,2.4,2.9,3.2]}

In [43]:
data

{'state': ['ohio', 'ohio', 'ohio', 'neva', 'neva', 'neva'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [44]:
frame=pd.DataFrame(data)

In [45]:
frame

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6
3  neva  2001  2.4
4  neva  2002  2.9
5  neva  2003  3.2

In [46]:
frame.head()

  state  year  pop
0  ohio  2000  1.5
1  ohio  2001  1.7
2  ohio  2002  3.6
3  neva  2001  2.4
4  neva  2002  2.9

In [47]:
pd.DataFrame(data,columns=["year","state","pop"])

   year state  pop
0  2000  ohio  1.5
1  2001  ohio  1.7
2  2002  ohio  3.6
3  2001  neva  2.4
4  2002  neva  2.9
5  2003  neva  3.2

In [48]:
frame2=pd.DataFrame(data,columns=["year","state","pop","debt"],index=["one","two","three","four","five","six"])

In [49]:
frame2

       year state  pop debt
one    2000  ohio  1.5  NaN
two    2001  ohio  1.7  NaN
three  2002  ohio  3.6  NaN
four   2001  neva  2.4  NaN
five   2002  neva  2.9  NaN
six    2003  neva  3.2  NaN

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
frame2["state"]

one      ohio
two      ohio
three    ohio
four     neva
five     neva
six      neva
Name: state, dtype: object

In [54]:
frame2.loc["one"]

year     2000
state    ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [55]:
frame2["debt"]=16.5

In [56]:
frame2

       year state  pop  debt
one    2000  ohio  1.5  16.5
two    2001  ohio  1.7  16.5
three  2002  ohio  3.6  16.5
four   2001  neva  2.4  16.5
five   2002  neva  2.9  16.5
six    2003  neva  3.2  16.5

In [59]:
frame2["debt"]=np.arange(6)

In [60]:
frame2

       year state  pop  debt
one    2000  ohio  1.5     0
two    2001  ohio  1.7     1
three  2002  ohio  3.6     2
four   2001  neva  2.4     3
five   2002  neva  2.9     4
six    2003  neva  3.2     5

In [61]:
val=pd.Series([1.2,3.4,1.9],index=["one","three","six"])

In [62]:
frame2["debt"]=val

In [63]:
frame2

       year state  pop  debt
one    2000  ohio  1.5   1.2
two    2001  ohio  1.7   NaN
three  2002  ohio  3.6   3.4
four   2001  neva  2.4   NaN
five   2002  neva  2.9   NaN
six    2003  neva  3.2   1.9

In [65]:
frame2["estern"] = frame2["state"]==True

In [66]:
del frame2["estern"]

In [67]:
frame2

       year state  pop  debt
one    2000  ohio  1.5   1.2
two    2001  ohio  1.7   NaN
three  2002  ohio  3.6   3.4
four   2001  neva  2.4   NaN
five   2002  neva  2.9   NaN
six    2003  neva  3.2   1.9